var str = '[00:00.00] 作曲 : 薛之谦\n[00:01.00] 作词: 薛之谦\n[00:14.800]反正现在的感情 都暧昧\n[00:20.130]你大可不必为难 找般配\n[00:24.820]付出过的人排队 谈体会\n[00:29.290]趁年轻别害怕一个人睡\n[00:34.170]可能是现在感情 太昂贵\n[00:39.080]让付出真心的人 好狼狈\n[00:43.950]还不如听首情歌 的机会 忘了谁\n[00:54.880]感情像牛奶一杯 越甜越让人生畏\n[01:04.320]都早有些防备 润色前的原味\n[01:13.350]所以人们都拿起咖啡 把试探放在两人位\n[01:23.860]距离感一对 就不必再赤裸相对\n[01:31.820]反正现在的感情 都暧昧\n[01:36.590]你大可不必为难 找般配\n[01:41.500]付出过的人排队 谈体会\n[01:46.150]弃之可惜 食而无味\n[01:51.080]可能是现在感情 太珍贵\n[01:55.630]让付出真心的人 好疲惫\n[02:00.600]谁不曾用过卑微的词汇 想留住谁\n[02:49.110]还贪恋着衣衫昂贵 却输给了廉价香水\n[02:59.080]他先诱你入位 还刻意放低了分贝\n[03:08.310]可感情越爱越妩媚 像烂掉的苹果一堆\n[03:17.980]连基因都不对 还在意什么鱼腥味\n[03:27.020]反正现在的感情 都暧昧\n[03:31.720]你大可不必为难 找般配\n[03:36.500]何必给自己沉迷 的机会\n[03:41.280]不如用误会来结尾\n[03:46.320]反正现在的我们 算暧昧\n[03:50.570]我愿意给的感情 请浪费\n[03:55.740]反正流过的眼泪 难收回\n[04:00.310]就别再安慰\n[04:05.450]看你入眠的侧脸 有多美\n[04:10.820]和你丢下的一切 好匹配\n[04:16.870]我还以为我能 多狼狈\n[04:23.090]我自以为\n'
// var str ="[00:00.00] 作曲 : 薛之谦\n[00:01.00] 作词 : 薛之谦\n[00:04.200]\n[00:21.120]简单点说话的方式简单点\n[00:28.560]\n[00:30.200]递进的情绪请省略\n[00:33.640]你又不是个演员\n[00:36.380]别设计那些情节\n[00:39.360]\n[00:41.930]没意见我只想看看你怎么圆\n[00:50.410]\n[00:51.540]你难过的太表面 像没天赋的演员\n[00:57.150]观众一眼能看见\n[01:00.190]\n[01:02.220]该配合你演出的我演视而不见\n[01:07.680]在逼一个最爱你的人即兴表演\n[01:12.900]什么时候我们开始收起了底线\n[01:18.020]顺应时代的改变看那些拙劣的表演\n[01:23.420]可你曾经那么爱我干嘛演出细节\n[01:28.630]我该变成什么样子才能延缓厌倦\n[01:33.870]原来当爱放下防备后的这些那些\n[01:39.370]才是考验\n[01:41.970]\n[01:44.600]没意见你想怎样我都随便\n[01:52.890]\n[01:54.530]你演技也有限\n[01:57.580]又不用说感言\n[02:00.150]分开就平淡些\n[02:02.990]\n[02:05.000]该配合你演出的我演视而不见\n[02:10.530]别逼一个最爱你的人即兴表演\n[02:15.810]什么时候我们开始没有了底线\n[02:21.010]顺着别人的谎言被动就不显得可怜\n[02:26.430]可你曾经那么爱我干嘛演出细节\n[02:31.520]我该变成什么样子才能配合出演\n[02:36.720]原来当爱放下防备后的这些那些\n[02:41.860]都有个期限\n[02:44.600]\n[02:47.560]其实台下的观众就我一个\n[02:53.040]其实我也看出你有点不舍\n[02:58.340]场景也习惯我们来回拉扯\n[03:02.930]还计较着什么\n[03:07.390]\n[03:08.710]其实说分不开的也不见得\n[03:14.040]其实感情最怕的就是拖着\n[03:19.210]越演到重场戏越哭不出了\n[03:24.070]是否还值得\n[03:28.120]\n[03:29.070]该配合你演出的我尽力在表演\n[03:34.390]像情感节目里的嘉宾任人挑选\n[03:39.680]如果还能看出我有爱你的那面\n[03:44.820]请剪掉那些情节让我看上去体面\n[03:50.040]可你曾经那么爱我干嘛演出细节\n[03:55.310]不在意的样子是我最后的表演\n[04:01.050]是因为爱你我才选择表演 这种成全\n"
// var str ="[00:00.00] 作曲 : 薛之谦\n[00:01.00] 作词 : 薛之谦\n[00:03.850]\n[00:18.980]好久没见了什么角色呢\n[00:23.220]细心装扮着\n[00:25.010]白色衬衫的袖扣是你送的\n[00:31.680]尽量表现着像不在意的\n[00:35.870]频繁暴露了自欺欺人者\n[00:41.250]越掩饰越深刻\n[00:44.290]你说我说听说\n[00:47.570]忍着言不由衷的段落\n[00:50.970]\n[00:51.860]我反正决定自己难过\n[00:58.430]\n[01:01.200]我想摸你的头发\n[01:03.400]只是简单的试探啊\n[01:06.740]\n[01:09.490]我想给你个拥抱\n[01:11.830]像以前一样可以吗\n[01:16.620]你退半步的动作认真的吗\n[01:21.280]小小的动作伤害还那么大\n[01:25.560]我只能扮演个绅士\n[01:28.750]才能和你说说话\n[01:32.840]\n[01:34.540]我能送你回家吗\n[01:37.150]可能外面要下雨啦\n[01:40.340]\n[01:43.220]我能给你个拥抱\n[01:45.450]像朋友一样可以吗\n[01:48.820]\n[01:50.630]我忍不住从背后抱了一下\n[01:55.010]尺度掌握在不能说想你啊\n[01:58.990]你就当刚认识的绅士\n[02:02.580]闹了个笑话吧\n[02:07.650]\n[02:21.060]尽量表现着善解人意的\n[02:25.320]频繁暴露了不欲人知的\n[02:30.880]越掩饰越深刻\n[02:33.830]想说听说别说\n[02:37.000]忍着言不由衷的段落\n[02:41.130]我反正注定留在角落\n[02:48.030]\n[02:50.270]我想摸你的头发\n[02:52.930]只是简单的试探啊\n[02:57.690]\n[02:58.700]我想给你个拥抱\n[03:01.320]像以前一样可以吗\n[03:05.020]\n[03:06.440]你退半步的动作认真的吗\n[03:10.860]小小的动作伤害还那么大\n[03:14.980]我只能扮演个绅士\n[03:18.270]才能和你说说话\n[03:22.140]\n[03:24.110]我能送你回家吗\n[03:26.650]可能外面要下雨啦\n[03:31.970]我能给你个拥抱\n[03:35.020]像朋友一样可以吗\n[03:38.640]\n[03:40.090]我忍不住从背后抱了一下\n[03:44.570]尺度掌握在不能说想你啊\n[03:48.480]你就当刚认识的绅士\n[03:52.130]闹了个笑话吧\n[03:56.320]\n[03:57.980]你能给我只左手\n[04:00.230]牵你到马路那头吗\n[04:03.880]\n[04:05.790]我会像以前一样\n[04:08.700]看着来往的车子啊\n[04:13.890]我们的距离在眉间皱了下\n[04:18.430]迅速还原成路人的样子啊\n[04:22.680]越有礼貌我越害怕\n[04:25.760]绅士要放得下\n[04:39.760]\n"
// "[00:00.00] 作曲 : 薛之谦\n[00:01.00] 作词 : 薛之谦\n[00:14.800]反正现在的感情 都暧昧\n[00:20.130]你大可不必为难 找般配\n[00:24.820]付出过的人排队 谈体会\n[00:29.290]趁年轻别害怕一个人睡\n[00:34.170]可能是现在感情 太昂贵\n[00:39.080]让付出真心的人 好狼狈\n[00:43.950]还不如听首情歌 的机会 忘了谁\n[00:54.880]感情像牛奶一杯 越甜越让人生畏\n[01:04.320]都早有些防备 润色前的原味\n[01:13.350]所以人们都拿起咖啡 把试探放在两人位\n[01:23.860]距离感一对 就不必再赤裸相对\n[01:31.820]反正现在的感情 都暧昧\n[01:36.590]你大可不必为难 找般配\n[01:41.500]付出过的人排队 谈体会\n[01:46.150]弃之可惜 食而无味\n[01:51.080]可能是现在感情 太珍贵\n[01:55.630]让付出真心的人 好疲惫\n[02:00.600]谁不曾用过卑微的词汇 想留住谁\n[02:49.110]还贪恋着衣衫昂贵 却输给了廉价香水\n[02:59.080]他先诱你入位 还刻意放低了分贝\n[03:08.310]可感情越爱越妩媚 像烂掉的苹果一堆\n[03:17.980]连基因都不对 还在意什么鱼腥味\n[03:27.020]反正现在的感情 都暧昧\n[03:31.720]你大可不必为难 找般配\n[03:36.500]何必给自己沉迷 的机会\n[03:41.280]不如用误会来结尾\n[03:46.320]反正现在的我们 算暧昧\n[03:50.570]我愿意给的感情 请浪费\n[03:55.740]反正流过的眼泪 难收回\n[04:00.310]就别再安慰\n[04:05.450]看你入眠的侧脸 有多美\n[04:10.820]和你丢下的一切 好匹配\n[04:16.870]我还以为我能 多狼狈\n[04:23.090]我自以为\n"
// var str1 = str.replace(/ /g, '')
// var str1 = str.split(/\n/g)
// var str = "[00:47.900]Wherever you are,↵[00:54.090]you know that I adore you↵[01:01.340]No matter how far,↵[01:07.610]well I can go before you↵[01:14.680]If ever you need someone,↵[01:21.100]what not that you need help in↵[01:28.230]But if ever you want someone,↵[01:34.640]you know that I am willing↵[01:37.750]oh and I don't want to change you↵[01:42.450]I don't want to change you↵[01:45.640]I don't want to change your mind↵[01:51.370]I just came across an angel,↵[01:56.070]out among the danger somewhere↵[02:01.120]In the stranger's eye↵[02:09.210]Wherever you go,↵[02:15.380]I can always follow↵[02:22.580]I can feed this real slow,↵[02:29.070]if it's a lot to swallow↵[02:36.300]If you just wanna be alone,↵[02:42.690]I can wait without waiting↵[02:49.740]If you want me to let this go,↵[02:56.180]I am more than willing↵[02:59.670]'Cause I don't want to change you↵[03:04.130]I don't want to change you↵[03:07.430]I don't want to change your mind↵[03:12.860]I just came across some angel,↵[03:17.340]out among the danger somewhere↵[03:22.620]In the stranger's eye↵[03:26.430]oh and I don't want to change you↵[03:30.860]I don't want to change you↵[03:34.170]I don't want to change your mind↵[03:39.880]I just came across some angel,↵[03:44.350]out among the danger somewhere↵[03:49.410]In the stranger's eye↵[03:51.640]I-I've never been with anyone↵[03:56.370]in the way I've been with you↵[03:59.590]But if love is not for fun,↵[04:02.330]then it's doomed↵[04:03.860]'Cause water races,↵[04:08.330]water races down↵[04:15.420]The waterfalls, water races,↵[04:21.910]water races down↵[04:29.120]The waterfalls!↵[04:31.470]and I don't want to change you↵[04:35.460]I don't want to change you↵[04:38.850]I don't want to change your mind↵[04:44.550]I just came across some angel↵[04:49.080]where there is no danger↵[04:52.170]Where love has eyes,↵[04:54.580]it is not blind↵"
// str = str.replace(/↵/g,'\n')
// console.log(str)

function parseLyric(lyric) {
    // var lrc = lyric.match(/^[^ ][\S ]*/mg);
    var lrc = lyric.match(/^[\S ]*/mg);
    // var lrc = lyric.match(/^.*/mg);????????
    // var lrc = lyric.match(/[^\n]*/mg);?????????????????????????????????????????为什么多一个空格
    console.log(lrc)
    var length = lrc.length;
    var lrcObj = {};
    var timeReg = /\[\d*:\d*.\d*\]/g
    for (var i = 0; i < length; i++) {
        let timeArr = lrc[i].match(timeReg)
        if (!timeArr) {
            console.log("oops")
            continue
        }
        timeArr = timeArr[0].match(/\d*:\d*.\d*/)
        console.log(timeArr)
        // console.log(timeArr)
        let clause = lrc[i].replace(timeReg, "")
        // console.log(clause)
        let min = parseInt(timeArr[0].split(':')[0])
        let sec = parseInt(timeArr[0].split(':')[1].split(".")[0])
        let time = min * 60 + sec;
        if(clause){
        lrcObj[time] = clause;
        }
    }
    return lrcObj;
}
console.log(parseLyric(str))
// parseLyric(str)
//     var timeReg = /\[\d*:\d*.\d*\]/g
// // console.log(str1)
// console.log(str1[6].replace(timeReg,''))





// function find(arr,fn){
//     let length = arr.length;
//     for(let i = 0;i<length;i++){
//         if(fn(arr[i])){
//             return arr[i]
//         }
//     }
//     return undefined;
// }
// var res =find([1,2,3,4,5],function(ele){
//     return ele % 2 === 0
// })
// console.log(res)









// var promise = {}
// promise.all = function (iterator) {
//     return new Promise(function (resolve, reject) {
//         let result = [];
//         let length = iterator.length;
//         let n = 0;
//         for (let i = 0; i < length; i++) {
//             iterator[i].then(function (res) {
//                 result[i] = res;
//                 n += 1;
//                 if (n === length) {
//                     resolve(result)
//                 }
//             })
//         }
//     })
// }
// function fn1(){
//     return new Promise(resolve => setTimeout(()=>resolve(1), 3000))
// }
// function fn2(){
//     return new Promise(resolve => setTimeout(()=>resolve(2), 2000))
// }
// promise.all([fn1(), fn2()]).then(res=>console.log(res), err=>console.log(err))